In [ ]:
# Install pandas using pip
pip install pandas
(or)
pip3 install pandas

#importing pandas 
import pandas as pd

#Upgrade Pandas 
pip install --upgrade pandas

## Series

In [1]:
# Create Series from array
import pandas as pd 
import numpy as np
data = np.array(['python','php','java'])
series = pd.Series(data)
print (series)

0    python
1       php
2      java
dtype: object

In [2]:
# Create pandas DataFrame with custom index
s2=pd.Series(data=data, index=['r1', 'r2', 'r3'])
print(s2)

r1    python
r2       php
r3      java
dtype: object

In [3]:
# Create a Dict from a input
data = {'Courses' :"pandas", 'Fees' : 20000, 'Duration' : "30days"}
s2 = pd.Series(data)
print (s2)

Courses     pandas
Fees         20000
Duration    30days
dtype: object

In [4]:
# Creating DataFrame from List
data = ['python','php','java']
s2 = pd.Series(data, index=['r1', 'r2','r3'])
print(s2)

r1    python
r2       php
r3      java
dtype: object

In [5]:
# Create empty Series
import pandas as pd
s = pd.Series()
print(s)

Series([], dtype: object)

In [6]:
# Convert series to dataframe
courses = pd.Series(["Spark","PySpark","Hadoop"], name='courses')
fees = pd.Series([22000,25000,23000], name='fees')
df=pd.concat([courses,fees],axis=1)
print(df)

   courses   fees
0    Spark  22000
1  PySpark  25000
2   Hadoop  23000

In [7]:
# Create DataFrame with single column
data =  ["Python","PHP","Java"]
df = pd.DataFrame(data, columns = ['Courses'])
my_series = df.squeeze()
print(my_series)
print (type(my_series))

0    Python
1       PHP
2      Java
Name: Courses, dtype: object
<class 'pandas.core.series.Series'>

## Create DataFrames

### Create pandas DataFrame

In [8]:
# Create pandas DataFrame from List
import pandas as pd
technologies = [ ["Spark",20000, "30days"], 
                 ["Pandas",25000, "40days"], 
               ]
df=pd.DataFrame(technologies)
print(df)

        0      1       2
0   Spark  20000  30days
1  Pandas  25000  40days

In [9]:
# Add Column & Row Labels to the DataFrame
column_names=["Courses","Fee","Duration"]
row_label=["a","b"]
df=pd.DataFrame(technologies,columns=column_names,index=row_label)
print(df)

  Courses    Fee Duration
a   Spark  20000   30days
b  Pandas  25000   40days

In [15]:
# Set custom types to DataFrame
types={'Courses': str,'Fee':float,'Duration':str}
df=df.astype(types)

### Create DataFrame from the Dic (dictionary)

In [16]:
# Create DataFrame from Dict
technologies = {
    'Courses':["Spark","Pandas"],
    'Fee' :[20000,25000],
    'Duration':['30days','40days']
              }
df = pd.DataFrame(technologies)
print(df)

  Courses    Fee Duration
0   Spark  20000   30days
1  Pandas  25000   40days

In [17]:
# Create DataFrame with Index.
technologies = {
    'Courses':["Spark","Pandas"],
    'Fee' :[20000,25000],
    'Duration':['30days','40days']
              }
index_label=["r1","r2"]
df = pd.DataFrame(technologies, index=index_label)
print(df)

   Courses    Fee Duration
r1   Spark  20000   30days
r2  Pandas  25000   40days

In [18]:
# Creates DataFrame from list of dict
technologies = [{'Courses':'Spark', 'Fee': 20000, 'Duration':'30days'},
        {'Courses':'Pandas', 'Fee': 25000, 'Duration': '40days'}]

df = pd.DataFrame(technologies)
print(df)

  Courses    Fee Duration
0   Spark  20000   30days
1  Pandas  25000   40days

In [19]:
# Create pandas Series
courses = pd.Series(["Spark","Pandas"])
fees = pd.Series([20000,25000])
duration = pd.Series(['30days','40days'])

# Create DataFrame from series objects.
df=pd.concat([courses,fees,duration],axis=1)
print(df)

        0      1       2
0   Spark  20000  30days
1  Pandas  25000  40days

In [22]:
# Assign Index to Series
index_labels=['r1','r2']
courses.index = index_labels
fees.index = index_labels
duration.index = index_labels

# Concat Series by Changing Names
df=pd.concat({'Courses': courses,
              'Course_Fee': fees,
              'Course_Duration': duration},axis=1)
print(df)

   Courses  Course_Fee Course_Duration
r1   Spark       20000          30days
r2  Pandas       25000          40days

### Creating DataFrame using zip() function

In [23]:
# Create Lists
Courses = ['Spark', 'Pandas']
Fee = [20000,25000]
Duration = ['30days','40days']
   
# Merge lists by using zip().
tuples_list = list(zip(Courses, Fee, Duration))
df = pd.DataFrame(tuples_list, columns = ['Courses', 'Fee', 'Duration'])
df

  Courses    Fee Duration
0   Spark  20000   30days
1  Pandas  25000   40days

### Create DataFrame From CSV File

In [30]:
df = pd.read_csv(r"C:\Users\Ganesh\Downloads\uber.csv")
df

,Date,Hour,Requests,Completes,Supply Hours,Time On Trip,pETA,aETA
0,9/1/2018,11,79,55,42.63,20.43,5.51,7.19
1,NaN,12,73,41,36.43,15.53,5.48,8.48
2,NaN,13,54,50,23.02,17.76,5.07,8.94
3,9/2/2018,11,193,170,64.20,31.47,5.31,6.55
4,NaN,12,258,210,80.28,38.68,4.94,6.08
...,...,...,...,...,...,...,...,...
85,NaN,12,378,306,99.07,52.02,5.75,6.60
86,NaN,13,321,149,76.90,30.55,5.86,6.42
87,9/30/2018,11,180,151,68.33,24.87,5.21,6.07
88,NaN,12,307,247,78.25,45.78,5.75,6.71
89,NaN,13,215,275,56.83,29.13,5.35,7.59

In [26]:
# Copy DataFrame to another
df2=df.copy()
print(df2)

         Date  Hour  Requests  Completes  Supply Hours  Time On Trip  pETA  \
0    9/1/2018    11        79         55         42.63         20.43  5.51
1         NaN    12        73         41         36.43         15.53  5.48
2         NaN    13        54         50         23.02         17.76  5.07
3    9/2/2018    11       193        170         64.20         31.47  5.31
4         NaN    12       258        210         80.28         38.68  4.94
..        ...   ...       ...        ...           ...           ...   ...
85        NaN    12       378        306         99.07         52.02  5.75
86        NaN    13       321        149         76.90         30.55  5.86
87  9/30/2018    11       180        151         68.33         24.87  5.21
88        NaN    12       307        247         78.25         45.78  5.75
89        NaN    13       215        275         56.83         29.13  5.35

    aETA
0   7.19
1   8.48
2   8.94
3   6.55
4   6.08
..   ...
85  6.60
86  6.42
87  6.07
88  6.71
89  7.59

[90 rows x 8 columns]

## Select Rows

# Quick Examples of Select Rows by Index Position & Labels

In [35]:

# Select Rows by Integer Index
df = df.iloc[2]     # Select Row by Index
df = df.iloc[[2,3,6]]    # Select Rows by Index List
df = df.iloc[1:5]   # Select Rows by Integer Index Range
df = df.iloc[:1]    # Select First Row
df = df.iloc[:3]    # Select First 3 Rows
df = df.iloc[-1:]   # Select Last Row
df = df.iloc[-3:]   # Select Last 3 Row
df = df.iloc[::2]   # Selects alternate rows

# Select Rows by Index Labels
df = df.loc['0']          # Select Row by Index Label
df = df.loc[['r2','r3','r6']]    # Select Rows by Index Label List
df = df.loc['r1':'r5']     # Select Rows by Label Index Range
df = df.loc['r1':'r5']     # Select Rows by Label Index Range
df = df.loc['r1':'r5':2]   # Select Alternate Rows with in Index Labels

IndexError: single positional indexer is out-of-bounds

In [46]:
import pandas as pd
import numpy as np
technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas","Oracle","Java"],
    'Fee' :[20000,25000,26000,22000,24000,21000,22000],
    'Duration':['30days','40days','35days','40days',np.nan,None,'55days'],
    'Discount':[1000,2300,1500,1200,2500,2100,2000]
               }
index_labels=['r1','r2','r3','r4','r5','r6','r7']
df = pd.DataFrame(technologies,index=index_labels)
print("Create DataFrame:\n", df)

Create DataFrame:
     Courses    Fee Duration  Discount
r1    Spark  20000   30days      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1500
r4   Python  22000   40days      1200
r5   Pandas  24000      NaN      2500
r6   Oracle  21000     None      2100
r7     Java  22000   55days      2000

### Select Rows by Index using Pandas iloc[]

In [47]:
# Select Row by Integer Index
df = df.iloc[2]
print("After selecting a row by index position:\n", df2)

After selecting a row by index position:
   Courses_List    Fee Duration
0        Spark  20000    30day
1      PySpark  25000   40days
2       Hadoop  26000   35days
3       Python  22000   40days
4       pandas  24000   60days
5       Oracle  21000   50days
6         Java  22000   55days

## Pandas Select Columns by Name or Index

In [48]:
# Example 1: By using df[] Notation
df = df[["Courses","Fee","Duration"]] # select multile columns

# Example 2: Using loc[] to take column slices
df = df.loc[:, ["Courses","Fee","Duration"]] # Selecte multiple columns
df = df.loc[:, ["Courses","Fee","Discount"]] # Select Random columns
df = df.loc[:,'Fee':'Discount'] # Select columns between two columns
df = df.loc[:,'Duration':]  # Select columns by range
df = df.loc[:,:'Duration']  # Select columns by range
df = df.loc[:,::2]          # Select every alternate column

# Example 3: Using iloc[] to select column by Index
df = df.iloc[:,[1,3,4]] # Select columns by Index
df = df.iloc[:,1:4] # Select between indexes 1 and 4 (2,3,4)
df = df.iloc[:,2:] # Select From 3rd to end
df = df.iloc[:,:2] # Select First Two Columns

IndexingError: Too many indexers

## Adding Column

In [37]:
# Create DataFrame
import pandas as pd
import numpy as np

technologies= {
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas"],
    'Fee' :[22000,25000,23000,24000,26000],
    'Discount':[1000,2300,1000,1200,2500]
          }

df = pd.DataFrame(technologies)
print("Create a DataFrame:\n", df)

Create a DataFrame:
    Courses    Fee  Discount
0    Spark  22000      1000
1  PySpark  25000      2300
2   Hadoop  23000      1000
3   Python  24000      1200
4   Pandas  26000      2500

In [38]:
# Add new column to the DataFrame
tutors = ['William', 'Henry', 'Michael', 'John', 'Messi']
df2 = df.assign(TutorsAssigned=tutors)
print("Add column to DataFrame:\n", df2)

Add column to DataFrame:
    Courses    Fee  Discount TutorsAssigned
0    Spark  22000      1000        William
1  PySpark  25000      2300          Henry
2   Hadoop  23000      1000        Michael
3   Python  24000      1200           John
4   Pandas  26000      2500          Messi

In [39]:
# Add multiple columns to the DataFrame
MNCCompanies = ['TATA','HCL','Infosys','Google','Amazon']
df2 = df.assign(MNCComp = MNCCompanies,TutorsAssigned=tutors )
print("Add multiple columns to DataFrame:\n", df2)

Add multiple columns to DataFrame:
    Courses    Fee  Discount  MNCComp TutorsAssigned
0    Spark  22000      1000     TATA        William
1  PySpark  25000      2300      HCL          Henry
2   Hadoop  23000      1000  Infosys        Michael
3   Python  24000      1200   Google           John
4   Pandas  26000      2500   Amazon          Messi

In [40]:
# Derive New Column from Existing Column
df = pd.DataFrame(technologies)
df2 = df.assign(Discount_Percent=lambda x: x.Fee * x.Discount / 100)
print("Add column to DataFrame:\n", df2)

Add column to DataFrame:
    Courses    Fee  Discount  Discount_Percent
0    Spark  22000      1000          220000.0
1  PySpark  25000      2300          575000.0
2   Hadoop  23000      1000          230000.0
3   Python  24000      1200          288000.0
4   Pandas  26000      2500          650000.0

## Rename Column

### Quick Examples Rename Columns of DataFrame

In [45]:
import pandas as pd
technologies = ({
  'Courses':["Spark","PySpark","Hadoop","Python","pandas","Oracle","Java"],
  'Fee' :[20000,25000,26000,22000,24000,21000,22000],
  'Duration':['30day', '40days' ,'35days', '40days', '60days', '50days', '55days']
              })
df = pd.DataFrame(technologies)
print(df.columns)

Index(['Courses', 'Fee', 'Duration'], dtype='object')

In [42]:
# Rename a Single Column 
df2=df.rename(columns = {'Courses':'Courses_List'})
print(df2.columns)

Index(['Courses_List', 'Fee', 'Duration'], dtype='object')

In [43]:
# Rename multiple columns
df.rename(columns = {'Courses':'Courses_List','Fee':'Courses_Fee', 
   'Duration':'Courses_Duration'}, inplace = True)
print(df.columns)

Index(['Courses_List', 'Courses_Fee', 'Courses_Duration'], dtype='object')

In [44]:
df

  Courses_List  Courses_Fee Courses_Duration
0        Spark        20000            30day
1      PySpark        25000           40days
2       Hadoop        26000           35days
3       Python        22000           40days
4       pandas        24000           60days
5       Oracle        21000           50days
6         Java        22000           55days

## Group By

In [51]:
import pandas as pd
technologies   = ({
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas","Hadoop","Spark","Python","NA"],
    'Fee' :[22000,25000,23000,24000,26000,25000,25000,22000,1500],
    'Duration':['30days','50days','55days','40days','60days','35days','30days','50days','40days'],
    'Discount':[1000,2300,1000,1200,2500,None,1400,1600,0]
          })
df = pd.DataFrame(technologies)
print("Create DataFrame:\n", df)

Create DataFrame:
    Courses    Fee Duration  Discount
0    Spark  22000   30days    1000.0
1  PySpark  25000   50days    2300.0
2   Hadoop  23000   55days    1000.0
3   Python  24000   40days    1200.0
4   Pandas  26000   60days    2500.0
5   Hadoop  25000   35days       NaN
6    Spark  25000   30days    1400.0
7   Python  22000   50days    1600.0
8       NA   1500   40days       0.0

In [52]:
# Use groupby() to compute the sum
df2 =df.groupby(['Courses']).sum()
print("Get sum of grouped data:\n", df2)

Get sum of grouped data:
            Fee      Duration  Discount
Courses
Hadoop   48000  55days35days    1000.0
NA        1500        40days       0.0
Pandas   26000        60days    2500.0
PySpark  25000        50days    2300.0
Python   46000  40days50days    2800.0
Spark    47000  30days30days    2400.0

In [53]:
# Group by multiple columns
df2 =df.groupby(['Courses', 'Duration']).sum()
print("Get sum of groupby multiple columns:\n", df2)

Get sum of groupby multiple columns:
                     Fee  Discount
Courses Duration
Hadoop  35days    25000       0.0
        55days    23000    1000.0
NA      40days     1500       0.0
Pandas  60days    26000    2500.0
PySpark 50days    25000    2300.0
Python  40days    24000    1200.0
        50days    22000    1600.0
Spark   30days    47000    2400.0